#Постановка задачи:
#Даны строки S, S1 и S2. Заменить в строке S все вхождения строки S1 на строку S2.

S = "Привет братцы! Привет Гаджишка!"
S1 = "Привет"
S2 = "Салам"

A = S.replace(S1, S2)
print(A)